## Plan Result (instant-sync-events-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/110376)



<pre><code>Plan: 33 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0
  * aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0
  * aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66
  * aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0
  * aws_iam_policy.eventtracker_sqs-policy_32E8FFAA
  * aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3
  * aws_iam_role.eventtracker_lambda_execution-role_6AC27719
  * aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C
  * aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD
  * aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A
  * aws_lambda_alias.eventtracker_lambda_alias_63DC690A
  * aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28
  * aws_lambda_function.eventtracker_lambda_2D56166D
  * aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311
  * aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32
  * aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91
  * aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.ListEventTopic-sns-subscription
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE
  * aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55
  * aws_sqs_queue.sns-topic-dql
  * aws_sqs_queue_policy.adm-sns-dlq-policy
  * aws_sqs_queue_policy.adm-sns-sqs-policy
  * pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.adm-sns-dlq-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "adm-sns-dlq-policy-document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.adm-sns-sqs-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "adm-sns-sqs-policy-document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.eventtracker_lambda_sqs_policy_DEBDCD47 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eventtracker_lambda_sqs_policy_DEBDCD47" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0 will be created
  + resource "aws_cloudwatch_log_group" "eventtracker_lambda_log-group_D52B53E0" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/InstantSyncEvents-Prod-EventTracker-Function"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
    }

  # aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0 will be created
  + resource "aws_codedeploy_app" "eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Lambda"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "InstantSyncEvents-Prod-EventTracker-Lambda"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66 will be created
  + resource "aws_codedeploy_deployment_group" "eventtracker_lambda-code-deploy_code-deployment-group_C430DA66" {
      + app_name                    = "InstantSyncEvents-Prod-EventTracker-Lambda"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.LambdaAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "InstantSyncEvents-Prod-EventTracker-Lambda"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags_all                    = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }
    }

  # aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0 will be created
  + resource "aws_iam_policy" "eventtracker_lambda_execution-policy_A74ACAF0" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "InstantSyncEvents-Prod-EventTracker-ExecutionRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:AttachNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all    = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
    }

  # aws_iam_policy.eventtracker_sqs-policy_32E8FFAA will be created
  + resource "aws_iam_policy" "eventtracker_sqs-policy_32E8FFAA" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "InstantSyncEvents-Prod-EventTracker-LambdaSQSPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all    = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
    }

  # aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3 will be created
  + resource "aws_iam_role" "eventtracker_lambda-code-deploy_code-deploy-role_761181E3" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "InstantSyncEvents-Prod-EventTracker-CodeDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eventtracker_lambda_execution-role_6AC27719 will be created
  + resource "aws_iam_role" "eventtracker_lambda_execution-role_6AC27719" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "InstantSyncEvents-Prod-EventTracker-ExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all              = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C will be created
  + resource "aws_iam_role_policy_attachment" "eventtracker_execution-role-policy-attachment_88191D7C" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "InstantSyncEvents-Prod-EventTracker-ExecutionRole"
    }

  # aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD will be created
  + resource "aws_iam_role_policy_attachment" "eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRoleForLambda"
      + role       = "InstantSyncEvents-Prod-EventTracker-CodeDeployRole"
    }

  # aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A will be created
  + resource "aws_iam_role_policy_attachment" "eventtracker_lambda_execution-role-policy-attachment_4A84019A" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "InstantSyncEvents-Prod-EventTracker-ExecutionRole"
    }

  # aws_lambda_alias.eventtracker_lambda_alias_63DC690A will be created
  + resource "aws_lambda_alias" "eventtracker_lambda_alias_63DC690A" {
      + arn              = (known after apply)
      + function_name    = "InstantSyncEvents-Prod-EventTracker-Function"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "DEPLOYED"
    }

  # aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28 will be created
  + resource "aws_lambda_event_source_mapping" "eventtracker_lambda_event_source_mapping_9B8B4F28" {
      + batch_size                         = 100
      + enabled                            = true
      + event_source_arn                   = (known after apply)
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + function_response_types            = [
          + "ReportBatchItemFailures",
        ]
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)
    }

  # aws_lambda_function.eventtracker_lambda_2D56166D will be created
  + resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "index.js.zip"
      + function_name                  = "InstantSyncEvents-Prod-EventTracker-Function"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 10
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "W3H4FeYY1XpXur5FoFbOhDmOD96dMyqqzRIkSf0dED4="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all                       = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "production"
              + "SENTRY_DSN"  = (sensitive value)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-2efb704a",
            ]
          + subnet_ids                  = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311 will be created
  + resource "aws_s3_bucket" "eventtracker_lambda_code-bucket_E2F7C311" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "pocket-instantsyncevents-prod-eventtracker"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all                    = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32 will be created
  + resource "aws_s3_bucket_acl" "eventtracker_lambda_code-bucket-acl_94F01E32" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91 will be created
  + resource "aws_s3_bucket_ownership_controls" "eventtracker_lambda_code-bucket-ownership-controls_AC55EF91" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663 will be created
  + resource "aws_s3_bucket_public_access_block" "eventtracker_lambda_code-bucket-public-access-block_5C535663" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "InstantSyncEvents-Prod-Infrastructure-Alarm-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "InstantSyncEvents-Prod-Infrastructure-Alarm-Non-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.ListEventTopic-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ListEventTopic-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = (known after apply)
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic"
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE will be created
  + resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_3DFE90FE" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "InstantSyncEvents-Prod-EventTracker-Queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all                          = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55 will be created
  + resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "InstantSyncEvents-Prod-EventTracker-Queue-Deadletter"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all                          = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.sns-topic-dql will be created
  + resource "aws_sqs_queue" "sns-topic-dql" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "InstantSyncEvents-Prod-SNS-Topics-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + tags_all                          = {
          + "environment" = "Prod"
          + "service"     = "InstantSyncEvents"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.adm-sns-dlq-policy will be created
  + resource "aws_sqs_queue_policy" "adm-sns-dlq-policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_sqs_queue_policy.adm-sns-sqs-policy will be created
  + resource "aws_sqs_queue_policy" "adm-sns-sqs-policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "InstantSyncEvents-Prod-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "InstantSyncEvents-Prod-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eventtracker_lambda-code-deploy_lambda_codedeploy_app_2EEE3C63   = "InstantSyncEvents-Prod-EventTracker-Lambda"
  + eventtracker_lambda-code-deploy_lambda_codedeploy_group_40A1C4DE = "InstantSyncEvents-Prod-EventTracker-Lambda"
  + eventtracker_lambda_lambda_arn_F8C20C18                          = (known after apply)
  + eventtracker_lambda_lambda_function_name_9A6276E1                = "InstantSyncEvents-Prod-EventTracker-Function"
  + eventtracker_lambda_lambda_version_arn_23ED45AF                  = (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"0a511e76-de41-4fc9-858a-8c5fc46150bf","JobName":"instant-sync-events_infrastructure_plan_prod","PRNumber":374,"Program":"tfcmt","SHA1":"19a614a7671cb982e7062ed698c30e09c415cab0","Target":"instant-sync-events-cdk","Vars":{}} -->